<template>
    <div>
        <h1>dashboard</h1>
        <div class="input">
            <input type="text" maxlength="16" />
        </div>
        <div>
            <p>人，只有在放弃战斗的时候才算输，只要坚持战斗，就还没输。</p>
            <p>你没有错，想做就做。</p>
            <p>你没能拯救你母亲是因为你没有力量，而我没有与巨人对抗是因为我没有勇气。</p>
            <p>你和我们下了不同的判断，是因为参考了不同的经验，做出选择，相信自己还是相信别人。</p>
            <p>那一天，人类回想起了，受那些家伙支配的恐怖……被囚禁在鸟笼中的屈辱……</p>
            <p>明明走出墙外一步就是地狱,成语造句，艾伦，为什么你还想要出去呢？</p>
            <p>就算相信自己的实力，相信值得信赖的同伴的选择，但还是没有人知道结果会怎样。所以啦，你就自己努力，选择一个自己不会留下遗憾的做法吧。</p>
            <p>对不起，艾伦，我再也，不会放弃了，如果死了的话，就连你的事，也想不起来了。</p>
            <p>不战斗就会输，战斗了可能也会死但也有可能活下来。</p>
            <p>不胜，则亡。但，不战，就不会胜利。</p>
            <p>不管做了多么明智合理的选择，在结果出来之前，谁都无法知道他的对错。到头来我们被允许做的，只是坚信那个选择，尽量不留下后悔而已。</p>
            <p>啊，这个世界，是残酷的啊，那个只允许胜利者生存的残酷的世界。</p>
            <p>人，只有在放弃战斗的时候才算输，只要坚持战斗，就还没输。</p>
            <p>你没有错，想做就做。</p>
            <p>你没能拯救你母亲是因为你没有力量，而我没有与巨人对抗是因为我没有勇气。</p>
            <p>你和我们下了不同的判断，是因为参考了不同的经验，做出选择，相信自己还是相信别人。</p>
            <p>那一天，人类回想起了，受那些家伙支配的恐怖……被囚禁在鸟笼中的屈辱……</p>
            <p>明明走出墙外一步就是地狱,成语造句，艾伦，为什么你还想要出去呢？</p>
            <p>就算相信自己的实力，相信值得信赖的同伴的选择，但还是没有人知道结果会怎样。所以啦，你就自己努力，选择一个自己不会留下遗憾的做法吧。</p>
            <p>对不起，艾伦，我再也，不会放弃了，如果死了的话，就连你的事，也想不起来了。</p>
            <p>不战斗就会输，战斗了可能也会死但也有可能活下来。</p>
            <p>不胜，则亡。但，不战，就不会胜利。</p>
            <p>不管做了多么明智合理的选择，在结果出来之前，谁都无法知道他的对错。到头来我们被允许做的，只是坚信那个选择，尽量不留下后悔而已。</p>
            <p>啊，这个世界，是残酷的啊，那个只允许胜利者生存的残酷的世界。</p>
        </div>
    </div>
</template>

<script setup lang="ts">
// aaa
</script>

<style lang="scss" scoped>
h1 {
    font-size: 30px;
}
.input {
    position: relative;
    overflow: hidden;
    margin: 20px 0;
    border: 1px solid #e5e7eb;
    border-radius: 30px;

    input {
        outline: none;
        border: 0;
        width: 100%;
        height: 38px;
        padding: 5px 18px;
        box-sizing: border-box;

        letter-spacing: 2px;
    }
}

p {
    padding: 10px 0;
    line-height: 1.6;
}
</style>
